Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.


int a = Convert.ToInt32(Console.ReadLine());
int b = Convert.ToInt32(Console.ReadLine());
int result = b * b;

if (result = a);

Console.Write("Yes");

Console.WriteLine(yes);
